
<div style="text-align: center;">
  <img src="https://github.com/Hack-io-Data/Imagenes/blob/main/01-LogosHackio/logo_naranja@4x.png?raw=true" alt="esquema" />
</div>


### 1. Todas las empresas cuyo nombre sea 'Babelgum'. Recupera solo su campo `name`.
### 2. Todas las empresas que tienen más de 5000 empleados. Limita la búsqueda a 20 empresas y ordénalas por **número de empleados**.
### 3. Todas las empresas fundadas entre 2000 y 2005, incluyendo ambos años. Recupera solo los campos `name` y `founded_year`.
### 4. Todas las empresas que tuvieron una valoración de más de 100.000.000 y que fueron fundadas antes de 2010. Recupera solo los campos `name` e `ipo`.
### 5. Todas las empresas que tienen menos de 1000 empleados y que fueron fundadas antes de 2005. Ordénalas por el número de empleados y limita la búsqueda a 10 empresas.
### 6. Todas las empresas que no incluyen el campo `partners`.
### 7. Todas las empresas que tienen un valor nulo en el campo `category_code`.
### 8. Todas las empresas que tienen al menos 100 empleados pero menos de 1000. Recupera solo los campos `name` y `number of employees`.
### 9. Ordena todas las empresas por su precio de IPO en orden descendente.
### 10. Recupera las 10 empresas con más empleados, ordenadas por el `número de empleados`.
### 11. Todas las empresas fundadas en el segundo semestre del año. Limita tu búsqueda a 1000 empresas.
### 12. Todas las empresas fundadas antes del año 2000 que tienen un monto de adquisición superior a 10.000.000.
### 13. Todas las empresas que han sido adquiridas después de 2010, ordénalas por el monto de adquisición, y recupera solo los campos `name` y `acquisition`.
### 14. Ordena las empresas por su `founded year`, recuperando solo los campos `name` y `founded year`.
### 15. Todas las empresas que han sido fundadas en los primeros siete días del mes, incluyendo el séptimo. Ordénalas por su `acquisition price` en orden descendente. Limita la búsqueda a 10 documentos.
### 16. Todas las empresas en la categoría 'web' que tienen más de 4000 empleados. Ordénalas por la cantidad de empleados en orden ascendente.
### 17. Todas las empresas cuyo monto de adquisición es superior a 10.000.000, y cuya moneda es 'EUR'.
### 18. Todas las empresas que han sido adquiridas en el primer trimestre del año. Limita la búsqueda a 10 empresas, y recupera solo los campos `name` y `acquisition`.

In [2]:
import pandas as pd
import json
import pymongo

In [51]:
cliente = pymongo.MongoClient()
print(cliente)

cliente.list_database_names()

empresas = cliente['Empresas'] # Esto es la DataBase
coleccion = empresas['n_empresas'] # esto son la coleccion Empresas dentro de la db Empresas

MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True)

Collection(Database(MongoClient(host=['localhost:27017'], document_class=dict, tz_aware=False, connect=True), 'Empresas'), 'n_empresas')

# SOLUCIONES

### 1. Todas las empresas cuyo nombre sea 'Babelgum'. Recupera solo su campo `name`.

In [174]:
df_name =  pd.DataFrame(coleccion.find({'name': 'Babelgum'},{'name':1, '_id':0}))

In [175]:
df_name

       name
0  Babelgum

### 2. Todas las empresas que tienen más de 5000 empleados. Limita la búsqueda a 20 empresas y ordénalas por **número de empleados**.

In [181]:
df_employee =  pd.DataFrame(coleccion.find({'number_of_employees': {"$gt": 5000}},{'number_of_employees':1,'_id':0,'name':1}).sort('number_of_employees',-1).limit(20))

In [182]:
df_employee

                                          name  number_of_employees
0                                      Siemens               405000
1                                          IBM               388000
2                                       Toyota               320000
3                                       PayPal               300000
4   Nippon Telegraph and Telephone Corporation               227000
5                          Samsung Electronics               221726
6                                    Accenture               205000
7                    Tata Consultancy Services               200300
8                    Flextronics International               200000
9                                      Safeway               186000
10                                        Sony               180500
11                                          LG               177000
12                                        Ford               171000
13                                      Boeing               160000
14               Digital Equipment Corporation               140000
15                                       Nokia               125000
16                         MItsubishi Electric               107000
17                         MItsubishi Electric               107000
18                                     Comcast               100000
19                                 Bertelsmann               100000

### 3. Todas las empresas fundadas entre 2000 y 2005, incluyendo ambos años. Recupera solo los campos `name` y `founded_year`.

In [188]:
df_fecha =  pd.DataFrame(coleccion.find({'founded_year': {"$gte": 2000, "$lte": 2005}},{'founded_year':1,'_id':0,'name':1}))

In [191]:
df_fecha

                name  founded_year
0           Wetpaint          2005
1               Zoho          2005
2               Digg          2004
3           Facebook          2004
4          Omnidrive          2005
...              ...           ...
3729  EnterSys Group          2000
3730  Axon Solutions          2004
3731         Intergy          2003
3732      AfterLogic          2002
3733       EnteGreat          2000

[3734 rows x 2 columns]

### 4. Todas las empresas que tuvieron una valoración de más de 100.000.000 y que fueron fundadas antes de 2010. Recupera solo los campos `name` e `ipo`.

In [196]:
df_valoracion = pd.DataFrame(coleccion.find({'ipo.valuation_amount': {'$gt': 100000000}, 'founded_year': {'$lt': 2010}}, {'name': 1, 'ipo': 1, '_id': 0}))

In [197]:
df_valoracion.head()

       name                                                ipo
0  Facebook  {'valuation_amount': 104000000000, 'valuation_...
1   Twitter  {'valuation_amount': 18100000000, 'valuation_c...
2      Yelp  {'valuation_amount': 1300000000, 'valuation_cu...
3  LinkedIn  {'valuation_amount': 9310000000, 'valuation_cu...
4    Amazon  {'valuation_amount': 100000000000, 'valuation_...

### 5. Todas las empresas que tienen menos de 1000 empleados y que fueron fundadas antes de 2005. Ordénalas por el número de empleados y limita la búsqueda a 10 empresas.

In [201]:
df_menos_empleados = pd.DataFrame(coleccion.find({'number_of_employees': {'$lt': 1000}, 'founded_year': {'$lt': 2005}}, {'name': 1, 'number_of_employees': 1, '_id': 0}).sort('number_of_employees', -1).limit(10))

In [202]:
df_menos_empleados

                              name  number_of_employees
0             Infinera Corporation                  974
1  NorthPoint Communications Group                  948
2                     888 Holdings                  931
3               Forrester Research                  903
4                        SonicWALL                  900
5                       Webmetrics                  900
6             Cornerstone OnDemand                  881
7                          Mozilla                  800
8                       Buongiorno                  800
9                             Yelp                  800

### 6. Todas las empresas que no incluyen el campo `partners`.

In [208]:
df_no_partners = pd.DataFrame(coleccion.find({'partners': {'$exists': False}}, {'name': 1, '_id': 0}))

In [210]:
df_no_partners

Empty DataFrame
Columns: []
Index: []

### 7. Todas las empresas que tienen un valor nulo en el campo `category_code`.

In [214]:
df_category_code_null = pd.DataFrame(coleccion.find({'category_code': None}, {'name': 1, '_id': 0}))

In [215]:
df_category_code_null.head()

           name
0    Collective
1       Snimmer
2        KoolIM
3  Level9 Media
4       VidKing

### 8. Todas las empresas que tienen al menos 100 empleados pero menos de 1000. Recupera solo los campos `name` y `number of employees`.

In [218]:
df_empleados_rango = pd.DataFrame(coleccion.find({'number_of_employees': {'$gte': 100, '$lt': 1000}}, {'name': 1, 'number_of_employees': 1, '_id': 0}).sort('number_of_employees',-1))

In [219]:
df_empleados_rango

                                name  number_of_employees
0                        Datamonitor                  984
1               Infinera Corporation                  974
2                                Box                  950
3    NorthPoint Communications Group                  948
4                       888 Holdings                  931
..                               ...                  ...
912                     SpringSource                  100
913                         NextLabs                  100
914                            InteQ                  100
915            Social Gaming Network                  100
916                              TDI                  100

[917 rows x 2 columns]

### 9. Ordena todas las empresas por su precio de IPO en orden descendente.

In [220]:
df_ipo_desc = pd.DataFrame(coleccion.find({}, {'name': 1, 'ipo': 1, '_id': 0}).sort('ipo.valuation_amount', -1))

In [221]:
df_ipo_desc

                      name                                                ipo
0                     GREE  {'valuation_amount': 108960000000, 'valuation_...
1                 Facebook  {'valuation_amount': 104000000000, 'valuation_...
2                   Amazon  {'valuation_amount': 100000000000, 'valuation_...
3                  Twitter  {'valuation_amount': 18100000000, 'valuation_c...
4                  Groupon  {'valuation_amount': 12800000000, 'valuation_c...
...                    ...                                                ...
18796               Adhunk                                               None
18797           AfterLogic                                               None
18798          goBookmaker                                               None
18799  EnteGreat Solutions                                               None
18800            EnteGreat                                               None

[18801 rows x 2 columns]

### 10. Recupera las 10 empresas con más empleados, ordenadas por el `número de empleados`.

In [224]:
df_top_empleados = pd.DataFrame(coleccion.find({}, {'name': 1, 'number_of_employees': 1, '_id': 0}).sort('number_of_employees', -1).limit(10))

In [225]:
df_top_empleados

                                         name  number_of_employees
0                                     Siemens               405000
1                                         IBM               388000
2                                      Toyota               320000
3                                      PayPal               300000
4  Nippon Telegraph and Telephone Corporation               227000
5                         Samsung Electronics               221726
6                                   Accenture               205000
7                   Tata Consultancy Services               200300
8                   Flextronics International               200000
9                                     Safeway               186000

### 11. Todas las empresas fundadas en el segundo semestre del año. Limita tu búsqueda a 1000 empresas.

In [229]:
df_segundo_semestre = pd.DataFrame(coleccion.find({'founded_month': {'$gte': 7}}, {'name': 1, '_id': 0}).limit(1000))

In [231]:
df_segundo_semestre

             name
0        Wetpaint
1            Zoho
2            Digg
3       Omnidrive
4            eBay
..            ...
995      LingusTV
996  AccountMaven
997      Chapatiz
998       YOOWALK
999   Data Domain

[1000 rows x 1 columns]

### 12. Todas las empresas fundadas antes del año 2000 que tienen un monto de adquisición superior a 10.000.000.

In [239]:
df_adquisiciones = pd.DataFrame(coleccion.find({'founded_year': {'$lt': 2000}, 'acquisition.price_amount': {'$gt': 10000000}}, {'name': 1, 'acquisition': 1, '_id': 0}))

In [240]:
df_adquisiciones

,name,acquisition
0,Postini,"{'price_amount': 625000000, 'price_currency_co..."
1,SideStep,"{'price_amount': 180000000, 'price_currency_co..."
2,Recipezaar,"{'price_amount': 25000000, 'price_currency_cod..."
3,PayPal,"{'price_amount': 1500000000, 'price_currency_c..."
4,Snapfish,"{'price_amount': 300000000, 'price_currency_co..."
...,...,...
200,Savvion,"{'price_amount': 49000000, 'price_currency_cod..."
201,Inventa Technologies,"{'price_amount': 30000000, 'price_currency_cod..."
202,Universal Microwave,"{'price_amount': 23200000, 'price_currency_cod..."
203,Advanced Control Components,"{'price_amount': 18780000, 'price_currency_cod..."
204,Contemporary Computer Services,"{'price_amount': 15040000, 'price_currency_cod..."

### 13. Todas las empresas que han sido adquiridas después de 2010, ordénalas por el monto de adquisición, y recupera solo los campos `name` y `acquisition`.

In [250]:
df_adquisiciones_2010 = pd.DataFrame(coleccion.find({'acquisition.acquired_year': {'$gt': 2010}}, {'name': 1, 'acquisition': 1, '_id': 0}).sort('acquisition.price_amount', -1))

In [251]:
df_adquisiciones_2010

,name,acquisition
0,T-Mobile,"{'price_amount': 39000000000, 'price_currency_..."
1,Goodrich Corporation,"{'price_amount': 18400000000, 'price_currency_..."
2,LSI,"{'price_amount': 6600000000, 'price_currency_c..."
3,National Semiconductor,"{'price_amount': 6500000000, 'price_currency_c..."
4,Ariba,"{'price_amount': 4300000000, 'price_currency_c..."
...,...,...
731,ALOT,"{'price_amount': None, 'price_currency_code': ..."
732,NeoEdge Networks,"{'price_amount': None, 'price_currency_code': ..."
733,ExpenseWire,"{'price_amount': None, 'price_currency_code': ..."
734,Celestial Semiconductor,"{'price_amount': None, 'price_currency_code': ..."
735,MyChances,"{'price_amount': None, 'price_currency_code': ..."

### 14. Ordena las empresas por su `founded year`, recuperando solo los campos `name` y `founded year`.

In [255]:
df_fundacion = pd.DataFrame(coleccion.find({}, {'name': 1, 'founded_year': 1, '_id': 0}).sort('founded_year', 1))

In [257]:
df_fundacion

                          name  founded_year
0                      itpints           NaN
1              Coupons Dealuxe           NaN
2                          Era           NaN
3      Pro Brand International           NaN
4               FTI Consulting           NaN
...                        ...           ...
18796                    Fixya        2013.0
18797                     Fluc        2013.0
18798                   Clowdy        2013.0
18799                 WhosCall        2013.0
18800    VistaGen Therapeutics        2013.0

[18801 rows x 2 columns]

### 15. Todas las empresas que han sido fundadas en los primeros siete días del mes, incluyendo el séptimo. Ordénalas por su `acquisition price` en orden descendente. Limita la búsqueda a 10 documentos.

In [265]:
df_early_fundacion = pd.DataFrame(coleccion.find({'founded_day': {'$lte': 7}}, {'name': 1, 'acquisition': 1, '_id': 0}).sort('acquisition.price_amount', -1).limit(10))

In [266]:
df_early_fundacion

                name                                        acquisition
0           Netscape  {'price_amount': 4200000000, 'price_currency_c...
1             PayPal  {'price_amount': 1500000000, 'price_currency_c...
2             Zappos  {'price_amount': 1200000000, 'price_currency_c...
3            Alibaba  {'price_amount': 1000000000, 'price_currency_c...
4            Postini  {'price_amount': 625000000, 'price_currency_co...
5             Danger  {'price_amount': 500000000, 'price_currency_co...
6  Clearwell Systems  {'price_amount': 410000000, 'price_currency_co...
7         PrimeSense  {'price_amount': 345000000, 'price_currency_co...
8             Amobee  {'price_amount': 321000000, 'price_currency_co...
9        BlueLithium  {'price_amount': 300000000, 'price_currency_co...

### 16. Todas las empresas en la categoría 'web' que tienen más de 4000 empleados. Ordénalas por la cantidad de empleados en orden ascendente.

In [274]:
df_web_empresas = pd.DataFrame(coleccion.find({'category_code': 'web', 'number_of_employees': {'$gt': 4000}}, {'name': 1, 'number_of_employees': 1, '_id': 0}).sort('number_of_employees', 1))

In [276]:
df_web_empresas

                            name  number_of_employees
0                        Expedia                 4400
1                            AOL                 8000
2                        Webkinz                 8657
3                        Rakuten                10000
4  Los Angeles Times Media Group                10000
5                        Groupon                10000
6                         Yahoo!                13600
7                           eBay                15000
8                       Experian                15500

### 17. Todas las empresas cuyo monto de adquisición es superior a 10.000.000, y cuya moneda es 'EUR'.

In [284]:
df_adquisicion_eur = pd.DataFrame(coleccion.find({'acquisition.price_amount': {'$gt': 10000000}, 'acquisition.price_currency_code': 'EUR'}, {'name': 1, 'acquisition': 1, '_id': 0}))

In [286]:
df_adquisicion_eur

                  name                                        acquisition
0                  ZYB  {'price_amount': 31500000, 'price_currency_cod...
1              Apertio  {'price_amount': 140000000, 'price_currency_co...
2    Greenfield Online  {'price_amount': 40000000, 'price_currency_cod...
3              Webedia  {'price_amount': 70000000, 'price_currency_cod...
4            Wayfinder  {'price_amount': 24000000, 'price_currency_cod...
5  Tuenti Technologies  {'price_amount': 70000000, 'price_currency_cod...
6       BioMed Central  {'price_amount': 43400000, 'price_currency_cod...

### 18. Todas las empresas que han sido adquiridas en el primer trimestre del año. Limita la búsqueda a 10 empresas, y recupera solo los campos `name` y `acquisition`.

In [297]:
df_adquisicion_c1 = pd.DataFrame(coleccion.find({'acquisition.acquired_month': {'$lte': 3}}, {'name': 1, 'acquisition': 1, '_id': 0}).limit(10))

In [299]:
df_adquisicion_c1

          name                                        acquisition
0         Kyte  {'price_amount': None, 'price_currency_code': ...
1   NetRatings  {'price_amount': 327000000, 'price_currency_co...
2       blogTV  {'price_amount': None, 'price_currency_code': ...
3   Livestream  {'price_amount': None, 'price_currency_code': ...
4     iContact  {'price_amount': 169000000, 'price_currency_co...
5      Coghead  {'price_amount': None, 'price_currency_code': ...
6  Dailymotion  {'price_amount': 168000000, 'price_currency_co...
7     Netvibes  {'price_amount': None, 'price_currency_code': ...
8       Flickr  {'price_amount': None, 'price_currency_code': ...
9   BabyCenter  {'price_amount': None, 'price_currency_code': ...